import 'package:flutter/material.dart';

class about_of_aplication extends StatelessWidget {
  const about_of_aplication ({super.key});
  

  @override
  Widget build(BuildContext context) {

    return SafeArea(
      child: Scaffold(
        appBar: AppBar(
          backgroundColor: Color.fromARGB(255, 146, 21, 223),
          title: Center(
              child: Text(
            "نموذخ عن التطبيق",
            style: TextStyle(color: Colors.white),
          )),
          actions: [
            IconButton(
              onPressed: () {},
              icon: Icon(
                Icons.search,
                color: Colors.white,
              ),
           
            ),
            IconButton(
              onPressed: () {},
              icon: Icon(
                Icons.home,
                color: const Color.fromARGB(255, 255, 255, 255),
              ),
            ),
          ],
        ),
        body: SingleChildScrollView(
          child: Container(
            padding: EdgeInsets.all(10),
            child: Column(
              children: [Text("نبذه علي البرنامج",style: TextStyle(fontWeight:FontWeight.w900,fontSize: 16),),
                Text(" تقارير وإحصائيات: يمكن للبرنامج توليد تقارير شاملة توضح أداء الورشة ومبيعات الخدمات والمخزون والفواتير وغيرها من المعلومات الهامة. يمكن أن تساعد هذه التقارير في اتخاذ قرارات استراتيجية لتحسين العمل ورفع مستوى الربحية.تعتمد ميزات البرنامج على النظام الذي تستخدمه ورشتك ومتطلباتها الفردية. يمكن تخصيص البرنامج وفقًا لاحتياجات ورشتك المحددة، وقد يتضمن ميزات إضافية مثل تتبع تاريخ الصيانة والإصلاحات السابقة، وتوفير قوائم قطع الغيار المفضلة والموردين، والتكامل مع نظام إدارة المحاسبة والمزيد.باختصار، يساعد برنامج ورشة السيارات في تبسيط وتحسين عمليات إدارة الورشة، بدءًا من جدولة المواعيد وإدارة المخزون وصولاً إلى تتبع الفواتير وتوليد التقارير. يعمل البرنامج على تحسين كفاءة العمل وتجربة العملاء ويساعدك في تنظيم الورشة بشكل أفضل وتعزيز الإنتاجية والربحيةإدارة المستخدمين والعملاء: يتيح لك البرنامج إنشاء ملفات للمستخدمين والعملاء وتتبع المعلومات الشخصية والتفاصيل الهامة مثل معلومات الاتصال وتواريخ الزيارة السابقة والتاريخ القادم المحدد للخدمة.جدولة المواعيد: يمكنك تحديد مواعيد الزيارة للعملاء وإدارة جدول الورشة بشكل فعال. يمكن للبرنامج توفير تنبيهات وتذكيرات للعملاء والموظفين بالمواعيد المقررة.ة المخزون: يمكن للبرنامج تتبع المخزون المتاح في الورشة بما في ذلك قطع الغيار والأدوات والمعدات الأخرى. يمكنه أيضًا توفير تنبيهات لإعادة تعبئة المخزون عند الحاجة. العمليات المرتبطة بورشة إصلاح السيارات. يهدف البرنامج إلى تحسين كفاءة العمل وتبسيط العمليات، ويمكن أن يكون له تأثير كبير على إدارة الورشة وتجربة العملاء.إليك نبذة عامة عن بعض الميزات الشائعة التي يمكن أن يوفرها برنامج ورشة السيارات:")],
            ),
          ),
        ),
      ),
    );
  }
}
